src/cf/AccumulationRegisters/уатОстаткиАгрегатов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>уатОстаткиАгрегатов</Name>
			<Comment>Остатки агрегатов на складах</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СерияНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатСерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МОЛ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/cf/Enums/уатРежимПолученияОстатков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>уатРежимПолученияОстатков</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НаТекущуюДату</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаДатуДокумента</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Catalogs/уатСерииНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>уатСерииНоменклатуры</Name>
			<Comment>Агрегаты (уат)</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипАгрегата</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатТипыАгрегатов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Модель</Name>
					<Comment>Модель агрегата</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.уатМоделиАгрегатов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СерийныйНомер</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПервоначальнаяСтоимость</Name>
					<Comment>Первоначальная стоимость агрегата</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Comment>Валюта первоначальной стоимости</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоЭксплуатации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>(Общ) Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГоденДо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПараметрВыработки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатПараметрыВыработки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПроизводстваШины</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокСлужбыШины</Name>
					<Comment>Срок службы, мес.</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/CommonForms/уатФормаПодбораАгрегатов/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Склад") Тогда
		Склад = Параметры.Склад;
	КонецЕсли;
	
	Если Параметры.Свойство("ДатаРасчетов") Тогда
		ДатаРасчетов = Параметры.ДатаРасчетов;
	КонецЕсли;
		
	Если Параметры.Свойство("Команда") Тогда
		КомандаПодбора = Параметры.Команда;
		Если КомандаПодбора = "ПодборВТабличнуюЧастьШины" Тогда
			УстановитьОтборПоШинамАккумуляторам(Справочники.уатТипыАгрегатов.Шина);
		ИначеЕсли КомандаПодбора = "ПодборВТабличнуюЧастьАккумуляторы" Тогда
			УстановитьОтборПоШинамАккумуляторам(Справочники.уатТипыАгрегатов.Аккумулятор);
		Иначе
			СписокТиповАгрегата = Новый Массив();
			СписокТиповАгрегата.Добавить(Справочники.уатТипыАгрегатов.Аккумулятор);
			СписокТиповАгрегата.Добавить(Справочники.уатТипыАгрегатов.Шина);
			УстановитьОтборПоПрочимАгрегатам(СписокТиповАгрегата);
		КонецЕсли;
	КонецЕсли;
	
	Настройки = ОбщегоНазначенияВызовСервера.ХранилищеОбщихНастроекЗагрузить("уатФормаПодбораАгрегатов",);
	Если Настройки <> Неопределено Тогда
		Если Настройки.Свойство("РежимПолученияОстатков") Тогда
			РежимПолученияОстатков = Настройки.РежимПолученияОстатков;
		КонецЕсли;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(ДатаРасчетов) Тогда
		ДатаРасчетов = ТекущаяДатаСеанса();
		Элементы.РежимПолученияОстатков.Доступность = Ложь;
		РежимПолученияОстатковПред = ?(ЗначениеЗаполнено(РежимПолученияОстатков), РежимПолученияОстатков, Перечисления.уатРежимПолученияОстатков.НаТекущуюДату);
		РежимПолученияОстатков = Перечисления.уатРежимПолученияОстатков.НаТекущуюДату;
		Элементы.РежимПолученияОстатков.СписокВыбора.Очистить();
		Элементы.РежимПолученияОстатков.СписокВыбора.Добавить(Перечисления.уатРежимПолученияОстатков.НаТекущуюДату, "на текущую дату", Истина);
		Элементы.РежимПолученияОстатков.СписокВыбора.Добавить(Перечисления.уатРежимПолученияОстатков.НаДатуДокумента, "на дату документа", Ложь);
	Иначе
		Элементы.РежимПолученияОстатков.СписокВыбора.Очистить();
		Элементы.РежимПолученияОстатков.СписокВыбора.Добавить(Перечисления.уатРежимПолученияОстатков.НаТекущуюДату, "на текущую дату");
		Элементы.РежимПолученияОстатков.СписокВыбора.Добавить(Перечисления.уатРежимПолученияОстатков.НаДатуДокумента, "на дату документа (" + Строка(ДатаРасчетов) + ")");
		Если Не ЗначениеЗаполнено(РежимПолученияОстатков) Тогда
			РежимПолученияОстатков = Перечисления.уатРежимПолученияОстатков.НаТекущуюДату;
		КонецЕсли;
	КонецЕсли; 
	
	ВосстановитьНастройки();
	
	//Элементы.ТолькоОстатки.Видимость = ЗначениеЗаполнено(Склад);
	Элементы.ТолькоОстатки.Заголовок = Нстр("en = 'Only in stock at'; ru = 'Только в наличии'") +
		?(ЗначениеЗаполнено(Склад), СтрШаблон(Нстр("en = '""%1"" warehouse'; ru = ' на складе ""%1""'"), Склад), Нстр("en = ' all warehouses'; ru = ' на всех складах'"));
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьСписокСОстатками();
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	Если ЗавершениеРаботы Тогда 
		Возврат;
	КонецЕсли;
	
	ПриЗакрытииНаСервере();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ТолькоОстаткиПриИзменении(Элемент)
	СписокАгрегатов.Параметры.УстановитьЗначениеПараметра("ТолькоОстатки", ТолькоОстатки);
КонецПроцедуры

&НаКлиенте
Процедура РежимПолученияОстатковПриИзменении(Элемент)
	СписокАгрегатов.Параметры.УстановитьЗначениеПараметра("Дата", ПолучитьДатуОстатков(РежимПолученияОстатков, ДатаРасчетов));
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_СписокАгрегатов

&НаКлиенте
Процедура СписокАгрегатовВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	СтруктураПодбора = Новый Структура();
	СтруктураПодбора.Вставить("Команда",      КомандаПодбора);
	МассивАгрегатов = Новый Массив;
	Если ТипЗнч(Значение) = Тип("Массив") Тогда
		Для каждого ТекСтрока Из Значение Цикл
			МассивАгрегатов.Добавить(ТекСтрока);
		КонецЦикла;
		СтруктураПодбора.Вставить("МассивАгрегатов", МассивАгрегатов);
	Иначе
		МассивАгрегатов.Добавить(Значение);
		СтруктураПодбора.Вставить("МассивАгрегатов", МассивАгрегатов);
	КонецЕсли;
	ОповеститьОВыборе(СтруктураПодбора);
	
	Если ЗакрыватьФормуПриВыборе Тогда
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_ИеарархияАгрегатов

&НаКлиенте
Процедура ИеарархияАгрегатовПриАктивизацииСтроки(Элемент)
	УстановитьОтборПоИерархииАгрегатов(Элементы.ИеарархияАгрегатов.ТекущаяСтрока);
КонецПроцедуры

&НаКлиенте
Процедура ИеарархияАгрегатовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	УстановитьОтборПоИерархииАгрегатов(ВыбраннаяСтрока);

КонецПроцедуры

#КонецОбласти      

&НаКлиенте
Процедура ЗакрыватьФормуПриВыбореПриИзменении(Элемент)
	
	СохранитьНастройки();
	
КонецПроцедуры

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьОтборПоШинамАккумуляторам(ЗначениеОтбора)
	
	ЭлементОтбора = СписокАгрегатов.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ТипАгрегата");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.Использование = Истина;
	ЭлементОтбора.ПравоеЗначение = ЗначениеОтбора;
	
КонецПроцедуры //

&НаСервере
Процедура УстановитьОтборПоПрочимАгрегатам(ЗначениеОтбора)
	
	ЭлементОтбора = СписокАгрегатов.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ТипАгрегата");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВСписке;
	ЭлементОтбора.Использование = Истина;
	ЭлементОтбора.ПравоеЗначение = ЗначениеОтбора;
	
КонецПроцедуры //

&НаСервере
Процедура УстановитьСписокСОстатками()
	
	СписокАгрегатов.ПроизвольныйЗапрос = Истина;
		
	Если НЕ ЗначениеЗаполнено(Склад) Тогда
		СписокАгрегатов.ТекстЗапроса =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	уатСерииНоменклатуры.Наименование,
		|	уатСерииНоменклатуры.Ссылка,
		|	уатСерииНоменклатуры.Код,
		|	уатСерииНоменклатуры.СерийныйНомер,
		|	уатСерииНоменклатуры.ТипАгрегата,
		|	уатОстаткиАгрегатовОстатки.КоличествоОстаток
		|ИЗ
		|	Справочник.уатСерииНоменклатуры КАК уатСерииНоменклатуры
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.уатОстаткиАгрегатов.Остатки(&Дата, ) КАК уатОстаткиАгрегатовОстатки
		|		ПО уатСерииНоменклатуры.Ссылка = уатОстаткиАгрегатовОстатки.СерияНоменклатуры
		|ГДЕ
		|	ВЫБОР
		|			КОГДА &ТолькоОстатки
		|				ТОГДА ЕСТЬNULL(уатОстаткиАгрегатовОстатки.КоличествоОстаток, 0) > 0
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|	И НЕ уатСерииНоменклатуры.ЭтоГруппа";
	Иначе
		СписокАгрегатов.ТекстЗапроса =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	уатСерииНоменклатуры.Наименование,
		|	уатСерииНоменклатуры.Ссылка,
		|	уатСерииНоменклатуры.Код,
		|	уатСерииНоменклатуры.СерийныйНомер,
		|	уатСерииНоменклатуры.ТипАгрегата,
		|	уатОстаткиАгрегатовОстатки.КоличествоОстаток
		|ИЗ
		|	Справочник.уатСерииНоменклатуры КАК уатСерииНоменклатуры
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.уатОстаткиАгрегатов.Остатки(&Дата, Склад = &Склад) КАК уатОстаткиАгрегатовОстатки
		|		ПО уатСерииНоменклатуры.Ссылка = уатОстаткиАгрегатовОстатки.СерияНоменклатуры
		|ГДЕ
		|	ВЫБОР
		|			КОГДА &ТолькоОстатки
		|				ТОГДА ЕСТЬNULL(уатОстаткиАгрегатовОстатки.КоличествоОстаток, 0) > 0
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|	И НЕ уатСерииНоменклатуры.ЭтоГруппа";
		
		СписокАгрегатов.Параметры.УстановитьЗначениеПараметра("Склад",Склад);
	КонецЕсли; 
	
	СписокАгрегатов.Параметры.УстановитьЗначениеПараметра("Дата", ПолучитьДатуОстатков(РежимПолученияОстатков, ДатаРасчетов));
	СписокАгрегатов.Параметры.УстановитьЗначениеПараметра("ТолькоОстатки", ТолькоОстатки);
	СписокАгрегатов.ОсновнаяТаблица = "Справочник.уатСерииНоменклатуры";	
	НайденныйЭлемент = Элементы.Найти("КоличествоОстаток");
	Если НайденныйЭлемент = Неопределено Тогда
		ПолеКоличество = Элементы.Добавить("КоличествоОстаток", Тип("ПолеФормы"), Элементы.СписокАгрегатов);
		ПолеКоличество.ПутьКДанным = "СписокАгрегатов.КоличествоОстаток";
		ПолеКоличество.Заголовок = НСтр("en='Remain';ru='Остаток'");
		ПолеКоличество.Подсказка = НСтр("en='Remain of car parts';ru='Остаток агрегатов'");
	КонецЕсли;
	
КонецПроцедуры //

&НаКлиенте
Процедура УстановитьОтборПоИерархииАгрегатов(ГруппаАгрегата)

	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(СписокАгрегатов, "Ссылка",
		ГруппаАгрегата, ЗначениеЗаполнено(ГруппаАгрегата), ВидСравненияКомпоновкиДанных.ВИерархии);

КонецПроцедуры

&НаСервере
Функция ПриЗакрытииНаСервере()

	ПараметрыЗакрытия = Новый Структура;
	Если Элементы.РежимПолученияОстатков.Доступность Тогда
		ПараметрыЗакрытия.Вставить("РежимПолученияОстатков", РежимПолученияОстатков);
	Иначе
		ПараметрыЗакрытия.Вставить("РежимПолученияОстатков", РежимПолученияОстатковПред);
	КонецЕсли;
	
	ОбщегоНазначенияВызовСервера.ХранилищеОбщихНастроекСохранить("уатФормаПодбораАгрегатов", , ПараметрыЗакрытия);

КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьДатуОстатков(РежимПолученияОстатков, ДатаРасчетов)
	
	ДатаОстатки = ?(РежимПолученияОстатков = Перечисления.уатРежимПолученияОстатков.НаТекущуюДату, Неопределено, ДатаРасчетов);
	Возврат ДатаОстатки;
	
КонецФункции

&НаСервере
Процедура СохранитьНастройки()

	УстановитьПривилегированныйРежим(Истина);
	
	СтруктураНастроек = Новый Структура();
	СтруктураНастроек.Вставить("ЗакрыватьФормуПриВыборе", ЗакрыватьФормуПриВыборе);
	
	ХранилищеНастроекДанныхФорм.Сохранить(
		"ОбщаяФорма.уатФормаПодбораАгрегатов",
		"ОбщиеНастройкиФормыПодбораАгрегатов",
		СтруктураНастроек
	);

КонецПроцедуры

&НаСервере
Процедура ВосстановитьНастройки()
	
	СтруктураНастроек = ХранилищеНастроекДанныхФорм.Загрузить(
		"ОбщаяФорма.уатФормаПодбораАгрегатов", 
		"ОбщиеНастройкиФормыПодбораАгрегатов"
	);
	
	Если ТипЗнч(СтруктураНастроек) = Тип("Структура") Тогда
		
		СтруктураНастроек.Свойство("ЗакрыватьФормуПриВыборе",               ЗакрыватьФормуПриВыборе);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
